import React from "react";
import ArrowSquareDownWhiteIcon from "@icons/ArrowSquareDownWhiteIcon";
import ArrowSquareDownDarkIcon from "@icons/ArrowSquareDownDarkIcon";
import clsx from "clsx";
import { cn } from "@/utils";

function Demo({ limit }: { limit?: number }) {
  return (
    <>
      {data.slice(0, limit).map((item, idx) => {
        return (
          <div
            key={idx}
            className={cn(
              "shadow-lg border-slate-100 border rounded-2xl overflow-hidden",
              idx < data.length - 1 && "mb-3"
            )}
          >
            <div className={clsx("collapse acc-collapse collapse-arrow bg-dark text-white relative")}>
              <input type="checkbox" name="my-accordion-2" defaultChecked={idx === 0} className={"absolute inset-0"} />
              <div className="collapse-title lg:text-sm text-xs flex gap-4 items-center">
                <i className="off">
                  <ArrowSquareDownWhiteIcon />
                </i>
                <i className="on">
                  <ArrowSquareDownDarkIcon />
                </i>
                {item.title}
              </div>
              <div className="collapse-content">
                {Array.isArray(item.content) ? (
                  item.content.map((text: string, i: number) => (
                    <p key={i} className="lg:text-sx text-xs leading-6 mb-2">
                      {text}
                    </p>
                  ))
                ) : (
                  <p className="lg:text-sx text-xs leading-6">{item.content}</p>
                )}
              </div>
            </div>
          </div>
        );
      })}
    </>
  );
}

export default Demo;

const data = [
  {
    title: "باینکس چیست؟",
    content:
      "باینکس مجموعه‌ای از ربات های تریدر یا ربات های معامله‌گر هست که این ربات ها تو بازار ارزهای دیجیتال یا همون کریپتوکارنسی ها معامله میکنن.",
  },
  {
    title: "چطوری از باینکس استفاده کنم؟",
    content:
      "شما قبل از هر چیز باید هر درصد سود و زیان هر ارز و ربات رو از توی سایت باینکس بررسی کنید و مطمئن بشید که قصد دارید معامله‌ی چه ارز یا چه ارزهایی رو برای خودتون فعال کنید و سپس با خرید اشتراک اون رمزارز، از قسمت داشبورد معاملات اون رمزارز رو برای ربات موردنظر و توی صرافی منظورتون برای خودتون فعال کنید.",
  },
  {
    title: "آیا ربات های باینکس به دارایی‌ های من دسترسی دارن؟",
    content:
      "خیر. شما هنگام ساخت api key میتونید دسترسی واریز و برداشت رو حذف کنید و ربات های باینکس فقط میتونن توی اکانت شما اقدام به خرید و فروش و معامله کنن.",
  },
  {
    title: "من پس از خرید اشتراک به کدوم ربات‌ ها و صرافی‌ ها دسترسی دارم؟",
    content:
      "دقت کنید که خرید اشتراک اختصاصی برای هر رمزارز هست و پس از خرید اشتراک، تمام ربات ها و صرافی های متصل به باینکس برای اون رمزارز قابل استفاده هستن",
  },
  {
    title: "چطوری معاملۀ یک ارز رو برای خودم فعال کنم؟",
    content:
      "پس از ثبت نام و خرید اشتراک، وارد داشبورد اختصاصی خودتون بشین و روی افزودن ربات جدید (آنلاین) کلیک کنید و اطلاعاتی که ازتون خواسته شده رو تکمیل کنید تا ربات موردنظر برای رمزارز مدنظرتون براتون فعال بشه.",
  },
  {
    title: "آیا باینکس درصدی از سود معاملات من رو برای خودش دریافت میکنه؟",
    content: "خیر، تنها درآمد باینکس از فروش اشتراک به کاربرانش هستش و هیچ مدل درآمدی دیگه‌ای نداره.",
  },
  {
    title: "اگر ربات های من توی معاملاتشون ضرر بدن باینکس ضرر و زیان من رو جبران میکنه؟",
    content:
      "مسئولیت سود و زیان معاملات کاملا با خودتونه. دقت کنید که قبل از فعال‌سازی هر ربات برای هر رمزارز، ابتدا مواردی مثل درصد سود و زیان هر رمزارز، درصد سود و زیان هر ربات، بیشترین میزان سود و زیان‌های مقطعی، معاملات رمزارزها طی بازه‌های زمانی مختلف و... رو کاملا بررسی کنید و بعد از بررسی کامل تصمیم بگیرید که چه رباتی رو برای چه ارزی فعال کنید.",
  },
  {
    title: "سود باینکس از چیه؟",
    content:
      "سود ما از فروش اشتراک هر رمزاز به شماست و به غیر از اون هیچ راه درآمد دیگری نداریم. بدیهیه که هرچقدر عملکرد ربات‌ها بهتر باشه، اشتراک‌ های بیشتری فروخته خواهد شد و سود ما هم بیشتر میشه. فلذا تمام تلاش ما اینه که ربات‌های باینکس با حداکثر سود و حداقل زیان اقدام به معامله کنن.",
  },
  {
    title:
      "اگر معاملات یک ربات برای یک رمزارز طی چندماه اخیر مثبت و همراه با سود بوده باشه میتونم بااطمینان ۱۰۰ درصد از سوددهی اون ربات رو برای خودم فعال کنم؟",
    content:
      "خیر، درصد سود و زیان هر ربات بستگی زیادی به شرایط بازار، رمزارز مربوطه، الگوریتم‌های ربات و موارد دیگری داره که باینکس در این موارد هم قطعی نیستن و شما نمیتونی بگی یک ربات صد در صد سود میده یا صد در صد نخواهد داد، اما میتونید با بررسی‌ های خودتون با درصد اطمینان بیشتری ربات‌ها رو برای خودتون فعال کنید.",
  },
  {
    title: "ربات‌های باینکس بر چه اساس و با چه معیاری معامله میکنن؟",
    content:
      "دیتاهای مربوط به چندین ایندیکاتور به همراه استراتژی به همراه قیمت‌های آغازین و پایانی هر کندل برای حدود ۲۰۰ رمزارز مختلف طی ۴ سال جمع‌آوری شده و سپس این دیتاها توسط هوش مصنوعی Learn شده و در نهایت بهترین الگوریتم‌های هوش مصنوعی تهیه و برای انجام معاملات انتخاب و تبدیل به ربات شده‌اند. درواقع الگوریتم‌ معاملاتی ربات‌های باینکس بر هوش مصنوعی با توجه به دیتایی که بهش داده شده مشخص میشه.",
  },
  {
    title: "درصد سود و زیان معاملاتم رو ازکجا میتونم ببینم؟",
    content:
      "شما میتوانید از قسمت سود و زیان در منوی داشبورد و همچنین از بخش تاریخچه سفارشات من درصد سود و زیان کلی و همچنین درصد سود و زیان توسط هر تفکیک هر معامله رو مشاهده کنید.",
  },
  {
    title: "چگونه پس از فعال کردن ربات‌ها میتوانم اون ربات رو غیرفعال کنم؟",
    content: [
      "کافیه وارد داشبورد شدید و از قسمت منوی دکمه‌ی ربات‌ها رو لمس کنید و سپس ربات‌های فعال من رو انتخاب کنید. حال میتونید هر رباتی که خواستید رو غیرفعال کنید.",
      "پس از غیرفعال کردن هر ربات هم، اگر همچنان اشتراک ربات مربوطه رو داشته باشید میتوانید از قسمت ربات‌های فعال من، ربات غیرفعال شده رو مجدد فعال کنید و برای اینکار نیاز به خرید مجدد اشتراک نیست.",
    ],
  },
];
