import Caption from "@/app/components/global/Caption";
import React from "react";

function Page() {
  return (
    <>
      <div className="container lg:mx-auto px-4  flex flex-col items-center justify-center gap-4 my-4">
        <div className="">
          <Caption className="text-black text-base lg:text-2xl font-bold ">آموزش استفاده از باینکس</Caption>
        </div>
        <div className="gap-10 flex flex-col">
          <div className="gap-4">
            <p className="text-justify lg:text-sm text-xs text-gray900 !leading-6">
              .در معنای لغوی، منابع انسانی به تمامی نیروهای کار یک مجموعه یا سازمان گفته می‌شود. در دنیای حرفه‌ای اما،
              منابع انسانی که به آن مدیریت منابع انسانی هم گفته می‌شود، بخش یا واحدی از یک کسب و کار است که مسئول رسیدگی
              و رفع نیازهای کارکنان در جهت بهره‌وری بیشتر نیز هست.
              <br />
              بخش منابع انسانی همچنین حقوق، مزایا و اخراج کارکنان را مدیریت کرده و وظیفه یافتن، غربالگری، استخدام و
              آموزش متقاضیان شغل را نیز بر عهده دارد. منابع انسانی را می‌توان یکی از با ارزش‌ترین واحدهای هر مجموعه
              دانسته و نقشی کلیدی در حفظ آرامش روانی کارکنان و جذب افراد مفید و کاربلد در قرن بیست و یکم ایفا
              می‌کند.واحد مدیریت منابع انسانی قرار است کمک کند تا سازمان، در افق زمانی بلند مدت، با کمترین هزینه، حداکثر
              کارایی را از کارکنان برای حرکت در راستای اهداف استراتژیک سازمان، کسب نماید. در معنای لغوی، منابع انسانی
              (Human Resources) به تمامی نیروهای کار یک مجموعه یا سازمان گفته می‌شود. در دنیای حرفه‌ای اما، منابع انسانی
              که به آن مدیریت منابع انسانی (HRM) هم گفته می‌شود، بخش یا واحدی از یک کسب و کار است که مسئول رسیدگی و رفع
              نیازهای کارکنان در جهت بهره‌وری بیشتر نیز هست. بخش منابع انسانی همچنین حقوق، مزایا و اخراج کارکنان را
              مدیریت کرده و وظیفه یافتن، غربالگری، استخدام و آموزش متقاضیان شغل را نیز بر عهده دارد. منابع انسانی را
              می‌توان یکی از با ارزش‌ترین واحدهای هر مجموعه دانسته و نقشی کلیدی در حفظ آرامش روانی کارکنان و جذب افراد
              مفید و کاربلد در قرن بیست و یکم ایفا می‌کند.واحد مدیریت منابع انسانی قرار است کمک کند تا سازمان، در افق
              زمانی بلند مدت، با کمترین هزینه، حداکثر کارایی را از کارکنان برای حرکت در راستای اهداف استراتژیک سازمان،
              کسب نماید.
            </p>
          </div>
          <div className="gap-4 flex flex-col lg:items-start items-center ">
            <Caption className="text-black lg:text-xl text-base font-medium  lg:text-right text-center">
              آموزش استفاده باینکس
            </Caption>
            <p className="text-justify lg:text-sm text-xs text-gray900 !leading-6">
              در معنای لغوی، منابع انسانی (Human Resources) به تمامی نیروهای کار یک مجموعه یا سازمان گفته می‌شود. در
              دنیای حرفه‌ای اما، منابع انسانی که به آن مدیریت منابع انسانی (HRM) هم گفته می‌شود، بخش یا واحدی از یک کسب
              و کار است که مسئول رسیدگی و رفع نیازهای کارکنان در جهت بهره‌وری بیشتر نیز هست. بخش منابع انسانی همچنین
              حقوق، مزایا و اخراج کارکنان را مدیریت کرده و وظیفه یافتن، غربالگری، استخدام و آموزش متقاضیان شغل را نیز بر
              عهده دارد. منابع انسانی را می‌توان یکی از با ارزش‌ترین واحدهای هر مجموعه دانسته و نقشی کلیدی در حفظ آرامش
              روانی کارکنان و جذب افراد مفید و کاربلد در قرن بیست و یکم ایفا می‌کند.واحد مدیریت منابع انسانی قرار است
              کمک کند تا سازمان، در افق زمانی بلند مدت، با کمترین هزینه، حداکثر کارایی را از کارکنان برای حرکت در راستای
              اهداف استراتژیک سازمان، کسب نماید. در معنای لغوی، منابع انسانی (Human Resources) به تمامی نیروهای کار یک
              مجموعه یا سازمان گفته می‌شود. در دنیای حرفه‌ای اما، منابع انسانی که به آن مدیریت منابع انسانی (HRM) هم
              گفته می‌شود، بخش یا واحدی از یک کسب و کار است که مسئول رسیدگی و رفع نیازهای کارکنان در جهت بهره‌وری بیشتر
              نیز هست. بخش منابع انسانی همچنین حقوق، مزایا و اخراج کارکنان را مدیریت کرده و وظیفه یافتن، غربالگری،
              استخدام و آموزش متقاضیان شغل را نیز بر عهده دارد. منابع انسانی را می‌توان یکی از با ارزش‌ترین واحدهای هر
              مجموعه دانسته و نقشی کلیدی در حفظ آرامش روانی کارکنان و جذب افراد مفید و کاربلد در قرن بیست و یکم ایفا
              می‌کند.واحد مدیریت منابع انسانی قرار است کمک کند تا سازمان، در افق زمانی بلند مدت، با کمترین هزینه، حداکثر
              کارایی را از کارکنان برای حرکت در راستای اهداف استراتژیک سازمان، کسب نماید.
            </p>
            <p className="text-justify lg:text-sm text-xs text-gray900 !leading-6">
              در معنای لغوی، منابع انسانی (Human Resources) به تمامی نیروهای کار یک مجموعه یا سازمان گفته می‌شود. در
              دنیای حرفه‌ای اما، منابع انسانی که به آن مدیریت منابع انسانی (HRM) هم گفته می‌شود، بخش یا واحدی از یک کسب
              و کار است که مسئول رسیدگی و رفع نیازهای کارکنان در جهت بهره‌وری بیشتر نیز هست. بخش منابع انسانی همچنین
              حقوق، مزایا و اخراج کارکنان را مدیریت کرده و وظیفه یافتن، غربالگری، استخدام و آموزش متقاضیان شغل را نیز بر
              عهده دارد. منابع انسانی را می‌توان یکی از با ارزش‌ترین واحدهای هر مجموعه دانسته و نقشی کلیدی در حفظ آرامش
              روانی کارکنان و جذب افراد مفید و کاربلد در قرن بیست و یکم ایفا می‌کند.واحد مدیریت منابع انسانی قرار است
              کمک کند تا سازمان، در افق زمانی بلند مدت، با کمترین هزینه، حداکثر کارایی را از کارکنان برای حرکت در راستای
              اهداف استراتژیک سازمان، کسب نماید. در معنای لغوی، منابع انسانی (Human Resources) به تمامی نیروهای کار یک
              مجموعه یا سازمان گفته می‌شود. در دنیای حرفه‌ای اما، منابع انسانی که به آن مدیریت منابع انسانی (HRM) هم
              گفته می‌شود، بخش یا واحدی از یک کسب و کار است که مسئول رسیدگی و رفع نیازهای کارکنان در جهت بهره‌وری بیشتر
              نیز هست. بخش منابع انسانی همچنین حقوق، مزایا و اخراج کارکنان را مدیریت کرده و وظیفه یافتن، غربالگری،
              استخدام و آموزش متقاضیان شغل را نیز بر عهده دارد. منابع انسانی را می‌توان یکی از با ارزش‌ترین واحدهای هر
              مجموعه دانسته و نقشی کلیدی در حفظ آرامش روانی کارکنان و جذب افراد مفید و کاربلد در قرن بیست و یکم ایفا
              می‌کند.واحد مدیریت منابع انسانی قرار است کمک کند تا سازمان، در افق زمانی بلند مدت، با کمترین هزینه، حداکثر
              کارایی را از کارکنان برای حرکت در راستای اهداف استراتژیک سازمان، کسب نماید.
            </p>
          </div>
        </div>
      </div>
    </>
  );
}

export default Page;
